UCB_CS61_lec24.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-09 四 22:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>第二十四课 Tree and Traversal</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="yiddishkop" />
<link rel="stylesheet" type="text/css" href="/home/yiddi/git_repos/YIDDI_org_export_theme/theme/org-nav-theme_cache.css" >
</head>
<body>
<div id="content">
<h1 class="title">第二十四课 Tree and Traversal</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge15d275">1. ROOTED TREES</a></li>
<li><a href="#orgd78c1b9">2. Representing Rooted Trees</a></li>
<li><a href="#org7571167">3. Tree Traversals</a>
<ul>
<li><a href="#orgd27300f">3.1. preorder traversal</a></li>
<li><a href="#orgfe9477c">3.2. postorder traversal</a></li>
<li><a href="#org607e5be">3.3. inorder traversal for binary trees</a></li>
<li><a href="#orge52acda">3.4. level-order traversal</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="orge15d275" class="outline-2">
<h2 id="orge15d275"><span class="section-number-2">1</span> ROOTED TREES</h2>
<div class="outline-text-2" id="text-1">
<p>
A <span class="underline">tree</span> consists of a set of nodes and a set of edges that connect pairs of
nodes.  A tree has the property that there is exactly one path (no more, no
less) between any two nodes of the tree.  A <span class="underline">path</span> is a sequence of one or more
nodes, each consecutive pair being connected by an edge.
</p>

<ul class="org-ul">
<li>注意 tree 的变形，实际上你可以把一棵树的任何一个 node 作为 root，只需要把他‘提起来’即可。</li>
<li>注意 graph 和 tree 的关系，tree 一开始就是无环路图，然后选中一个 note 为 root
之后，整个 tree 才形成。</li>
</ul>

<p>
In a <span class="underline">rooted</span> tree, one distinguished node is called the <span class="underline">root</span>.  Every node c,
except the root, has exactly one <span class="underline">parent</span> node p, which is the first node after
c on the path from c to the root.  c is p's <span class="underline">child</span>.  The root has no parent.
A node can have any number of children.
</p>

<p>
Some other definitions:
</p>

<ul class="org-ul">
<li>A <span class="underline">leaf</span> is a node with no children.</li>
<li>An <span class="underline">internal_node</span> is a non-leaf node (having one or more children).</li>
<li><span class="underline">Siblings</span> are nodes with the same parent.</li>
<li>The <span class="underline">ancestors</span> of a node d are the nodes on the path from d to the root.
These include d's parent, d's parent's parent, d's parent's parent's parent,
and so forth up to the root. Technically, the ancestors of d also include d
itself, which makes you wonder about d's sex life. The root is an ancestor
of every node in the tree.</li>
<li>If a is an ancestor of d, then d is a <span class="underline">descendant</span> of a.</li>
<li>The <span class="underline">length</span> of a path is the number of edges in the path.</li>
<li>The <span class="underline">depth</span> of a node n is the length of the path from n to the root.  (The
depth of the root is zero.)</li>
<li>The <span class="underline">height</span> of a node n is the length of the path from n to its deepest
descendant.  (The height of a leaf node is zero.)</li>
<li>The <span class="underline">height of a tree</span> is the depth of its deepest node = height of the root.</li>
<li>The <span class="underline">subtree</span> rooted at node n is the tree formed by n and its descendants.</li>
<li>A <span class="underline">binary_tree</span> is a tree in which no node has more than two children, and
every child is either a <span class="underline">left_child</span> or a <span class="underline">right_child</span>, even if it's the
only child its parent has.</li>
<li><span class="underline">internal node</span> (non-leaf node)</li>
</ul>

<p>
A commonly encountered application of trees is the directory structure of a
file system.
</p>

<pre class="example">
        _______~jrs/61b_______               &lt;-- Root node
       /      |        |      \
      /       |        |       \
    hw   index.html   lab      _lec__
   / \                /\      / /\ \ \_
  /   \     ^        /  \    / /  \ \  \
hw1  hw2    |     lab1 lab2 01 02 03 04 05   &lt;-- Leaf nodes
        Leaf node
</pre>
</div>
</div>
<div id="orgd78c1b9" class="outline-2">
<h2 id="orgd78c1b9"><span class="section-number-2">2</span> Representing Rooted Trees</h2>
<div class="outline-text-2" id="text-2">
<p>
Goodrich and Tamassia present a data structure in which each node has three
references:  one reference to an item, one reference to the node's parent, and
one reference to the node's children, which can be stored in any reasonable
data structure like a linked list.  Directories are typically stored this way,
but the lists they use are represented very differently than our list ADTs.
</p>

<p>
Another popular tree representation spurns separately encapsulated linked lists
so that siblings are directly linked.  It retains the "item" and "parent"
references, but instead of referencing a list of children, each node references
just its leftmost child.  Each node also references its next sibling to the
right.  The "nextSibling" references are used to join the children of a node in
a singly-linked list, whose head is the node's "firstChild".
</p>

<p>
I'll call this tree a "SibTree", since siblings are central to the
representation.  The nodes I call "SibTreeNodes".
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">SibTreeNode</span> {                  |  <span style="color: #4f97d7; font-weight: bold;">class</span> SibTree {
  <span style="color: #ce537a; font-weight: bold;">Object</span> <span style="color: #7590db;">item</span>;                       |    SibTreeNode root;
  <span style="color: #ce537a; font-weight: bold;">SibTreeNode</span> <span style="color: #7590db;">parent</span>;                |    <span style="color: #ce537a; font-weight: bold;">int</span> size;
  <span style="color: #ce537a; font-weight: bold;">SibTreeNode</span> <span style="color: #7590db;">firstChild</span>;            |  }
  <span style="color: #ce537a; font-weight: bold;">SibTreeNode</span> <span style="color: #7590db;">nextSibling</span>;           |
}                                    |

</pre>
</div>

<pre class="example" id="SibTree">
===============================================================================
+ ROOTED TREE | --------------------             ---------------------------- +
=============== |---          ---- |             |          parent          | +
+               ||.|root  size|14| |             ---------------------------- +
+               |-+-          ---- |             |           item           | +
+               --|-----------------             ---------------------------- +
+                 v     SibTree object           | firstChild | nextSibling | +
+               -----                            ---------------------------- +
+               | * |                              structure of SibTreeNodes  +
+               -----                                                         +
+ Root node =&gt;  |jrs|                                                         +
+               -----&lt;---------                                               +
+               |.|*|          \                                              +
+               /----&lt;----      \                                             +
+              /  ^^      \      \                                            +
+             v  /  \      \      \                                           +
+            ---/-  -\---  -\---  -\---                                       +
+            | . |  | . |  | . |  | . |                                       +
+            -----  -----  -----  -----                                       +
+            |hw |  |ind|  |lab|  |lec|&lt;------------------------              +
+            -----  -----  -----  -----&lt;------------------      \             +
+            |.|.+-&gt;|*|.+-&gt;|.|.+-&gt;|.|*|&lt;------------      \      \            +
+            /----  -----  /----  --\--&lt;------      \      \      \           +
+           /  ^^         /   ^^     \ ^      \      \      \      \          +
+          v  /  \       v   /  \     \ \      \      \      \      \         +
+         ---/-  -\---   ---/-  -\---  &gt;-\---  -\---  -\---  -\---  -\---     +
+         | . |  | . |   | . |  | . |   | . |  | . |  | . |  | . |  | . |     +
+         -----  -----   -----  -----   -----  -----  -----  -----  -----     +
+         |hw1|  |hw2|   |lb1|  |lb2|   |01 |  |02 |  |03 |  |04 |  |05 |     +
+         -----  -----   -----  -----   -----  -----  -----  -----  -----     +
+         |*|.+-&gt;|*|*|   |*|.+-&gt;|*|*|   |*|.+-&gt;|*|.+-&gt;|*|.+-&gt;|*|.+-&gt;|*|*|     +
+         -----  -----   -----  -----   -----  -----  -----  -----  -----     +
===============================================================================
</pre>
</div>
</div>

<div id="org7571167" class="outline-2">
<h2 id="org7571167"><span class="section-number-2">3</span> Tree Traversals</h2>
<div class="outline-text-2" id="text-3">
<p>
A <span class="underline">traversal</span> is a manner of <span class="underline">visiting</span> each node in a tree once. What you do
when visiting any particular node depends on the application; for instance, you
might print a node's value, or perform some calculation upon it. There are
several different traversals, each of which orders the nodes differently.
</p>
</div>

<div id="orgd27300f" class="outline-3">
<h3 id="orgd27300f"><span class="section-number-3">3.1</span> preorder traversal</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Many traversals can be defined recursively. In a <span class="underline">preorder</span> traversal, you visit
each node before recursively visiting its children, which are visited from left
to right. The root is visited first.
</p>

<p>
It's more convinent to define traversal in <span class="underline">SibTreeNode class</span> than SibTree
class, because it's going to <span class="underline">operate recursively on the nodes</span>
</p>
<div class="org-src-container">
<pre class="src src-java" id="org9fcd5b8"><span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">SibTreeNode</span> {
  <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">preorder</span>() {
<span id="coderef-visit" class="coderef-off">    <span style="color: #4f97d7; font-weight: bold;">this</span>.visit(); (visit)</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> (firstChild != <span style="color: #a45bad;">null</span>) {
      firstChild.preorder();
    }
    <span style="color: #4f97d7; font-weight: bold;">if</span> (nextSibling != <span style="color: #a45bad;">null</span>) {
      nextSibling.preorder();
    }
  }
}
</pre>
</div>

<p>
Suppose your method visit() numbers the nodes in the order they're visited. A
preorder traversal visits the nodes in this order.
</p>

<pre class="example">
     1
    / \
   /   \
  2     6
 /|\   / \
3 4 5 7   8
</pre>

<p>
Each node is visited only once, so a preorder traversal takes O(n) time, where n
is the number of nodes in the tree. All the traversals we will consider take
O(n) time.
</p>

<p>
注意只有 <a href="#coderef-visit" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-visit');" onmouseout="CodeHighlightOff(this, 'coderef-visit');">visit</a> 真正访问了 node，而 preorder 的其他操作只相当于 _移动光标_递归仅处理高度为 1 的树, preorder traversal：
</p>

<ol class="org-ol">
<li>visit root</li>
<li>move cursor to left</li>
<li>move cursor to right</li>
</ol>

<p>
A preorder traversal is a natural way to print a directory's structure. Simply
have the method visit() print each node of the tree.
</p>

<pre class="example">
~jrs/61b
   hw
      hw1
      hw2
   index.html
   lab
      lab1
      lab2
   lec
      01
      02
      03
      04
      05
</pre>
</div>
</div>
<div id="orgfe9477c" class="outline-3">
<h3 id="orgfe9477c"><span class="section-number-3">3.2</span> postorder traversal</h3>
<div class="outline-text-3" id="text-3-2">
<p>
In a <span class="underline">postorder</span> traversal, you visit each node's children (in left-to-right
order) before the node itself.
</p>

<div class="org-src-container">
<pre class="src src-java" id="orga6d1a55"><span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">postorder</span>() {
  <span style="color: #4f97d7; font-weight: bold;">if</span> (firstChild != <span style="color: #a45bad;">null</span>) {
    firstChild.postorder();
  }
  <span style="color: #4f97d7; font-weight: bold;">this</span>.visit();
<span id="coderef-sibling" class="coderef-off">  <span style="color: #4f97d7; font-weight: bold;">if</span> (nextSibling != <span style="color: #a45bad;">null</span>) { (sibling)</span>
    nextSibling.postorder();
  }
}
</pre>
</div>
<p>
我一直觉得这个是中序遍历，直到我想到 <span class="underline">中序遍历</span> 是 if childL? -&gt; visit -&gt; if childR?
而这里是 if childL? -&gt; visit -&gt; if <a href="#coderef-sibling" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-sibling');" onmouseout="CodeHighlightOff(this, 'coderef-sibling');">sibling</a>?
</p>


<p>
递归仅处理高度为 1 的树, postOrder traversal：
</p>
<ol class="org-ol">
<li>move cursor to left</li>
<li>visit</li>
<li>move cursor to right</li>
</ol>


<p>
A postorder traversal visits the nodes in this order.
</p>
<pre class="example">
     8
    / \
   /   \
  4     7
 /|\   / \
1 2 3 5   6
</pre>

<p>
The postorder() code is trickier than it looks. The best way to understand it is
to draw a depth-two tree on paper, then pretend you're the computer and execute
the algorithm carefully. Trust me on this. It's worth your time.
</p>

<p>
A postorder traversal is the natural way to sum the total disk space used in the
root directory and its descendants. The method visit() sums "this" node's disk
space with the disk space of all its children. In the example above, a postorder
traversal would first sum the sizes of the files in hw1/ and hw2/; then it would
visit hw/ and sum its two children. The last thing it would compute is the total
disk space at the root ~jrs/61b/, which sums all the files in the tree.
</p>
</div>
</div>


<div id="org607e5be" class="outline-3">
<h3 id="org607e5be"><span class="section-number-3">3.3</span> inorder traversal for binary trees</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Binary trees allow for an <span class="underline">inorder</span> traversal: recursively traverse the root's
left subtree (rooted at the left child), then the root itself, then the root's
right subtree. The preorder, inorder, and postorder traversals of an expression
tree will print a <span class="underline">prefix</span>, <span class="underline">infix</span>, or <span class="underline">postfix</span> expression, respectively.
</p>

<pre class="example">
     +
    / \         Prefix:  + * 3 7 ^ 4 2
   /   \
  *     ^        Infix:  3 * 7 + 4 ^ 2
 / \   / \
3   7 4   2    Postfix:  3 7 * 4 2 ^ +
</pre>
</div>
</div>

<div id="orge52acda" class="outline-3">
<h3 id="orge52acda"><span class="section-number-3">3.4</span> level-order traversal</h3>
<div class="outline-text-3" id="text-3-4">
<p>
In a <span class="underline">level-order</span> traversal, you visit the root, then all the depth-1 nodes
(from left to right), then all the depth-2 nodes, et cetera. The level-order
traversal of our expression tree is "+ * ^ 3 7 4 2" (which doesn't mean much).
</p>

<p>
Unlike the three previous traversals, a level-order traversal is not
straightforward to define recursively.  However, a level-order traversal can be
done in O(n) time.  Use a <span class="underline">queue</span>, which initially contains only the root.  Then
repeat the following steps:
</p>
<ul class="org-ul">
<li>Dequeue a node.</li>
<li>Visit it.</li>
<li>Enqueue its children (in order from left to right).</li>
</ul>
<p>
Continue until the queue is empty.
</p>

<p>
A final thought:  if you use a stack instead of a queue, and push each node's
children in reverse order&#x2013;from right to left (so they pop off the stack in
order from left to right)&#x2013;you perform a preorder traversal.  Think about why.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
